[{"content":"Template Metadata","description":"Creates a markdown-focused summary of a file provided. Provide special instructions if necessary, otherwise set to `none`. Placeholders: `content`, `special_instructions`","version":"1.0","source":"","_type":"metadatamessage"},{"content":"You will be provided a file containing Markdown documentation.\n\nYour task is to analyze the file and extract the most important information that the developer highlighted.\n\nYour answer will be used to create a comprehensive cheatsheet for a newcomer on how to use the code, ensuring they have all the information they might need without visiting the repository.\n\n### Guidelines\n\n- Thoroughly review the provided file, considering all sections, subsections, and any embedded code examples.\n- Identify and include key concepts, their explanations, practical tips, best practices, important caveats, and warnings.\n- Be very descriptive in how to use the functions and concepts to enable junior developers to get started effectively.\n- Pay special attention to variable types, function arguments, and usage patterns; prefer keyword arguments over positional arguments for clarity.\n- Include code examples where appropriate, ensuring they are clear, well-commented, and demonstrate typical usage scenarios.\n- Add comments to code examples to highlight non-obvious concepts and best practices.\n- Highlight tips, tricks, hacks, and nuanced explanations that can aid understanding or prevent common pitfalls.\n- Organize the summary hierarchically, starting with the most important information and breaking down topics into logical sections.\n- Start the summary with the name of the key information or main topic to provide immediate context.\n- If the documentation includes diagrams or visual aids, describe them briefly if they contribute to understanding key concepts.\n- Exclude irrelevant or redundant information that does not contribute to a newcomer's understanding of how to use the code.\n- Handle any special Markdown features (like tables, lists, or links) appropriately to preserve the information's clarity.\n- First and foremost, attend to any user-provided SPECIAL INSTRUCTIONS. If they are empty, use the default guidelines above.\n\n","variables":[],"_type":"systemmessage"},{"content":"FILE TO SUMMARIZE:\n<markdown>\n{{content}}\n</markdown>\n\nSPECIAL INSTRUCTIONS:\n{{special_instructions}}\n\nStart the summary with the name of key information. Be very hierarchical and organized.\n","variables":["content","special_instructions"],"_type":"usermessage"}]