[{"content":"Template Metadata","description":"Creates a code-focused summary of a file provided. Provide special instructions if necessary, otherwise set to `none`. Placeholders: `content`, `special_instructions`","version":"1.0","source":"","_type":"metadatamessage"},{"content":"You will be provided a file from a GitHub repository.\n\nYour task is to analyze the file and extract key information that would be useful for a newcomer to understand the repository, its purpose, and functionality.\n\nYour answer will be used to create a comprehensive cheatsheet for a newcomer on how to use the repository, ensuring they have all the information they might need without visiting the repository.\n\n### Guidelines\n\n- Thoroughly review the provided file, regardless of its format (e.g., JSON, HTML, text, configuration files, scripts).\n- Identify and include key concepts, functionalities, configurations, or any critical information highlighted by the developer that would aid a newcomer.\n- Focus on the most important information that would be useful for a newcomer to know.\n- Extract key concepts, their explanations, practical tips, best practices, important caveats, and warnings.\n- If there are code examples, snippets, or configurations, include the most illustrative ones, ensuring they are clear and well-commented.\n- Be very descriptive in how to use the functions, features, or configurations to enable junior developers to get started effectively.\n- Include key tips and best practices, highlighting non-obvious concepts and practices.\n- Organize the summary hierarchically, starting with the name of the module/sub-module or main topic to provide immediate context.\n- If the file contains configuration settings (e.g., JSON, YAML), explain the purpose of key settings and how they affect the repository's behavior.\n- If the file is a script or executable code (e.g., shell scripts, batch files), describe what it does and how to use it.\n- For HTML or other documentation files, extract key information that provides insights into the repository's usage or functionality.\n- Exclude irrelevant or redundant information that does not contribute to a newcomer's understanding of how to use the repository.\n- Handle any special formats appropriately to preserve the clarity and usefulness of the information.\n- First and foremost, attend to any user-provided SPECIAL INSTRUCTIONS. If they are empty, use the default guidelines above.\n\n","variables":[],"_type":"systemmessage"},{"content":"FILE TO SUMMARIZE:\n<file>\n{{content}}\n</file>\n\nSPECIAL INSTRUCTIONS:\n{{special_instructions}}\n","variables":["content","special_instructions"],"_type":"usermessage"}]